 bool XXX(char * s){
    int n=strlen(s),i;
    char *t=(char*)malloc(n/2);//临时栈
    for(i=0;n>0;)
    {
        if(s[n-1]=='('||s[n-1]=='{'||s[n-1]=='[')//判断括号匹配
        {
            if(i==0)
            return 0;//临时栈无元素，不匹配
            if((s[n-1]=='('&&t[i-1]==')')||(s[n-1]=='{'&&t[i-1]=='}')||(s[n-1]=='['&&t[i-1]==']'))//匹配，则出栈
            {
                n-=1;
                i--;
            }
            else return 0;//不匹配，无效
              
        }

        if(n>=2&&(s[n-1]-s[n-2]==1)||(s[n-1]-s[n-2]==2))//若互相匹配则出栈
           n-=2;
        else if(s[n-1]==')'||s[n-1]==']'||s[n-1]=='}')//入临时栈，等待配对
        {
            t[i++]=s[n-1];
            n--;
        }
    }
    return true;
}

